БИТУправление_медицинским_центром_демо/src/Catalogs/ХранилищеДополнительнойИнформации/ХранилищеДополнительнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХранилищеДополнительнойИнформации</name>
  <attributes>
    <name>Объект</name>
    <comment>Объект</comment>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Хранилище</name>
    <comment>Хранилище</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВФайле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Классификация</name>
    <type>
      <types>CatalogRef.КлассификацияПрикрепленныхФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйВладелец</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Catalogs/ХранилищеДополнительнойИнформации/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура АктуализироватьКонечногоВладельцаФайловОбъекта(ОбъектСсылка, Объект = Неопределено) Экспорт
	
	Если ОбъектСсылка.Метаданные().Реквизиты.Найти("Клиент") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Объект <> Неопределено Тогда
		КонечныйВладелец = Объект.Клиент;
	Иначе
		КонечныйВладелец = ОбъектСсылка.Клиент;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", ОбъектСсылка);
	Запрос.УстановитьПараметр("КонечныйВладелец", КонечныйВладелец);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХранилищеДополнительнойИнформации.Ссылка КАК Ссылка,
	|	ХранилищеДополнительнойИнформации.КонечныйВладелец КАК КонечныйВладелец
	|ИЗ
	|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	|ГДЕ
	|	ХранилищеДополнительнойИнформации.Объект = &Объект
	|	И ХранилищеДополнительнойИнформации.КонечныйВладелец <> &КонечныйВладелец"
	;
	Выб = Запрос.Выполнить().Выбрать();
	
	Пока Выб.Следующий() Цикл
		ФайлОбъект = Выб.Ссылка.ПолучитьОбъект();
		ФайлОбъект.КонечныйВладелец = КонечныйВладелец;
		ФайлОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
